<?php

use Facade\FlareClient\Http\Client;

return [


    //---------------------------------------------------------------------front

    // welcome page
    'ara'    =>  'العربية',
    'eng'    =>  'English',

    'login' =>  'تسجيل الدخول',
    'cart'  =>  'السلة',

    'go_cart'   =>  'الذهاب للسلة',
    'total' =>  'الاجمالي',

    // navbar
    'be_ta'    =>  'كن تاجراً',
    'contact_us'    =>  'تواصل معنا',

    'forget_pass'   =>  'نسيت كلمة المرور ؟',
    'create_account' =>  'انشاء حساب',

    'have_account'  =>  'لديك حساب ؟',

    'back_password' =>  'استعادة كلمة المرور',
    'enter_pass'    =>  'ادخل الايميل الخاص بك المرتبط بحساب متجر نماء',

    'my_account'    =>  'حسابي',
    'app_log'   =>  'سجل الطلبات',
    'alert' =>  'التنبيهات',

    'get_app'   =>  'احصل على رابط التطبيق من خلال رسالة قصيرة',
    'get_phone' =>  'ادخل رقم الهاتف',
    'get_link'  =>  'احصل على الرابط',



    // footer
    'support'   =>  'الدعم',
    'ask'  =>  'اسئل التاجر',
    'contact'  =>  'تواصل مع نماء',
    'qp'  =>  'الأسئلة الشائعة',
    'order_and_contact'  =>  'الطلبات والتوصيل',
    'company_d' =>  'شركاء التوصيل',
    'company_and_contact'  =>  'شركاء التوصيل',
    'policity'  =>  'سياسة الارجاع',
    'about_nemaa'  =>  'عن نيماء',
    'who_us'  =>  'من نحن',
    'protection'  =>  'حماية المشتري',
    'subscripe' =>  'اشترك الآن',
    'all_rights'    =>  'جميع الحقوق محفوظة لنماء',


    'shop_now'  =>  'تسوق الآن',

    't_product' =>   'منتج',


    'available' =>  'متاح',
    'bought'    =>  'مباع',
    'product_det'   =>  'تفاصيل المنتج',
    'ratings'   =>  'التقيمات',
    'product_desc'  =>  'وصف المنتج',
    'product_avg'   =>  'متوسط تصنيف النجوم',
    'out_of'    =>  'من',

    'share' =>  'شارك رأيك مع الزبائن الآخرين',
    'write_rating'  =>  'اكتب تقييمك',

    'review_note'   =>  'اعط تفاصيل عن تجربتك في استخدام المنتج. انتبه لنموذج الجودة
    والراحة والامتثال للخصائص المعلنة.',

    'star'  =>  'نجوم',
    'title' =>  'العنوان',
    'features'  =>  'المميزات',
    'defects'   =>  'العيوب',
    'review'    =>  'المراجعة',
    'p_c'   =>  'صندوق بريد رقم',
    'phone_number'  =>  'رقم الهاتف',


    //nama
    'we_us' =>  'من نحن',

    // contact us section
    'add_msg'   =>  'عنوان الرسالة',
    'msg'       =>  'الرسالة',
    'send_msg'  =>  'ارسال رسالة',
    'address'   =>  'العنوان',
    'box_email' =>  'صندوق البريد',
    'email_code'    =>  'الرمز البريدي',
    'work_time' =>  'ساعات العمل',
    'location'   =>  'الموقع',

    // delivery sevtion
    'delivery'  =>  'التوصيل',
    'order_delivery'    =>  'الطلبات والتوصيل',
    'company_delivery'  =>  'شركاء التوصيل',

    //support
    'support'   =>  'الدعم',
    'msg_qp'    =>  'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى،
حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها
التطبيق، إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما
تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه
الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن هنا وجب
على المصمم أن يضع نصوصا مؤقهذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى
زيادة عدد الحروف التى يولدها التطبيق، إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص
العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي',

    // show store
    'store_name'    =>  'اسم المتجر',
    'found_about'   =>  'عثر على',
    'buy_now'   =>  'شراء الآن',
    'result'    => 'نتيجة',
    'all_product'   =>  'عرض جميع المنتجات ',


    //-- show product
    'product_pro'   =>  'خصائص المنتج',

    'product_name'  =>  'إسم المنتج',

    'product_number'  =>  'رقم المنتج',

    'number_sale'   =>  'عدد المبيعات',

    'comments'  =>  'التعليقات',

    'product_details_pro'   =>  'الحماية والتعليمات',

    'recent'    =>  'شاهد أيضا بعض المنتجات المرتبطة بهدا العنصر !',

    // cart
    'add_cart'  =>  'اضافة للسلة',

    'remove_cart'   =>  'ازالة من السلة',


    'user_data' =>  'بيانات المستخدم',

    'pay_pro'   =>  'الدفع والتوصيل',

    'confirm_process'   => 'تأكيد عملية الشراء',

    'item'  =>  'العنصر',


    'back_shop' =>  'عودة للتسوق',

    'msg_success'   =>  'تم ارسال الطلب بنجاح',

    'next'  =>  'التالي',

    'raw'   =>  'المواد الخام',

    'ad_p'  =>  'عنوان الشحن',

    'zip_code'  =>  'الرمز البريدي',


    // order list
    'product_is_arraive'    =>  'قيد التوصيل',
    'confirm_order' =>  'تأكيد الاستلام',
    'add_rating'   =>  'اضافة تقيم',
    'order_suucess' =>  'تم استلام الطلب بنجاح',
    'name_store'   =>  'اسم المتجر',
    'order_number'  =>  'رقم الطلب',
    'order_date'    =>  'تاريخ الطلب',
    'order_success_msg' =>  'نم تأكيد استلام الطلب',
    'order_status'  => 'الحالة',
    'order_success_arraive'  =>  'تم شحن المنتج، بامكانك متابعة حالة الطلب من خلال قسم طلباتي',
    'order_no_arraive'  => 'تم استلام الطلب ! يمكنك تقيم الطلب ومراجعة المتجر عن حالة الطلب',
    'for_auth'  =>  'نعلمك بأنه سيتم إضافة قسم " محتوى نصي " للموقع 
    نتمنى بان نكون
    دائما عند حسن ظنكم ',
    'alerts'    => 'التنبيهات',


    // pay page
    'shipping'  =>  'الشحن',
    'name_shi'  =>  'نماء',
    'time_out'  =>  'الوقت المقدر للتوصيل',
    'shi_cost'  =>  'تكلفة الشحن',
    'shi_result'    =>  'شحن مجاني',
    'payment'   =>  'الدفع',
    'chose_pay' =>  'الرجاء اختيار وسيلة الدفع',
    'cash'  =>  'كاش',
    'cash_info' =>  'الدفع عند الاستلام',
    'confirm_sale'  =>  'تأكيد عملية الشراء',
    'product_des'  =>  'تفاصيل الطلب',
    'tax'   =>  'الضريبة',
    'discount'  =>  'خصم',
    'no_dis'    =>  'لا يوجد خصم',
    // index front
    'category_website'  =>  'أقسام الموقع',
    'watch_all'  =>  'مشاهدة الكل',
    'quick_offers'  =>  'عروض سريعة',
    'new_store'  =>  'متاجر جديدة',
    'by_now'  =>  'شراء الأن',
    'new'   =>  'جديد',
    'most_sells'    =>  'الأكثر مبيعاً',

    'color'  =>  'اللون',
    'size'  =>  'الحجم',


    // user data
    'order_list'    =>  'سجل الطلبيات',
    'notification'  =>  'التنبيهات',
    'upload_new_image'  =>  'تحميل صورة جديدة',
    'update_data'   =>  'تحديث البيانات',

    // ---------------------------------------------------------------- Dashboard

    //welcome  dashboard  page
    'welcome'   =>  'الرئيسية',

    // aside------------------------------------
    'dashboard'     =>      'لوحة التحكم',
    'logout'        =>      'تسجيل خروج',
    'product'   => 'المنتجات',


    // nav
    'home'      =>          'الرئيسية',

    // user page
    'user'      =>         'المشرف',
    'users'     =>          'المشرفين',
    'add_user'  =>          'اضافة مشرف',
    'peremption' =>  'الصلاحيات',
    'index'     =>  'الصفحة الرئيسية',
    'edit_data'     =>  'التعديل على البيانات',
    'edit_user'     =>  'تعديل بيانات المشرف',
    'more_info' =>  'المزيد من المعلومات',
    'sale_g'    =>  'الرسم البياني',

    //category page
    'name_category' =>  'اسم القسم',
    'add_category'  =>  'اضافة قسم',
    'general_info_cat'  =>  'معلومات عن القسم',
    'name'              =>  'الاسم',
    'add_by'        =>  'تمت الاضافة بواسطة',
    'edit_category' =>  'تعديل على القسم',



    // table
    'first_name'    =>  'الاسم الأول',
    'last_name'     =>  'الاسم الأخير',
    'image'         => 'الصورة',
    'images'         => 'الصور',
    'email'         =>  'البريد الالكتروني',
    'country'       =>  'الدولة',
    'created_at'    =>  'تاريخ الانشاء',
    'action'        => 'أكشن',
    'edit'          =>  'تعديل',
    'delete'        => 'حدف',
    'role'          =>  'الوظيفة',
    'admin'         =>  'مشرف',

    // title card
    'general_info'  => 'معلومات عن المشرف',
    'style_and_details' =>  'الشكل والتفاصيل',


    // create form label
    'select_image'  =>  'اختار صورة',
    'password'      => 'كلمة المرور',
    'conf_pass'     => 'تأكيد كلمة المرور',
    'select_country'    => 'اختار الدولة',
    'city'          =>  'المدينة',
    'postal_code'   => 'الرمز البريدي',


    // product -------------------------------
    'product'       =>  'المنتج',
    'products'       =>  'المنتجات',
    'add_Product'   =>  'اضافة منتج',
    'general_info_product'  =>  'معلومات عامة عن المنتج',
    'gender'            =>  'الجنس',
    'male'              =>  'ذكر',
    'female'              =>  'انثى',
    'optional'          =>  'هدا الحقل اختياري وليس اجباري',
    'sizes'             =>  'المقاسات',
    'gender_desc'       =>  'الاستخدام للدكور أو الاناث ان
    وجد',
    'size_desc' =>  'حددت ان كان هدا المنتج له مقاسات ام لا',
    'colors_available'  =>  'الألوان المتوافرة ان وجدت',
    'current_sale_price'        =>  'سعر البيع الحالي',
    'purchase_price'    =>  'سعر الشراء',
    'new_sale_price'    =>  'سعر البيع الجديد ان وجد تخفيضات !',
    'stoke' =>  'المخزون',
    'desc_use'  =>  'وصف واستخدام المنتج',
    'desc' =>   'الوصف',
    'sale_price'    => 'سعر البيع',
    'profit'    =>  'المكسب',
    'product_count' =>  'عدد المنتجات المرتبطة',
    'all_cat'   =>  'كل الاقسام',
    'edit_products'  =>  'تعديل المنتجات',
    'note_image'    =>  'اترك الحقل ان كنت لا ترغب في تغيير الصور',

    // client page
    'client'   =>  'العميل',
    'clients'   =>  'العملاء',
    'search_client_place'   =>  'ابحث عن عميل',
    'create_client' =>  'اضافة عميل',
    'add_client'    =>  'اضافة عميل',
    'edit_client'   =>  'تعديل عميل',

    // order page
    'orders'    =>  'الطلبيات',
    'order'     =>  'الطلب',
    'add_order' =>  'اضافة طلب',
    'add'   =>  'اضافة',
    'quantity'  =>  'العدد',
    'price'  =>  'السعر',
    'client_list'   =>  'قائمة العملاء',
    'add_at'    =>  'تمت الاضافة',
    'show'  =>  'عرض',
    'order_list'    =>  'قائمة الطلبيات',
    'total' =>  'السعر الاجمالي',
    'edit_order'    =>  'تعديل الطلب',
    'print' =>  'اطبع',
    'previous'  =>  'الطلبيات السابقة',


    // stores page
    'store'    =>  'المتجر',
    'stores'    =>  'المتاجر',
    'search_place_store'    =>  'ابحث عن متجر',
    'create_store'  =>  'انشاء متجر',
    'category_count'    =>  'عدد الأقسام',
    'rating'    =>  'التقيم',
    'general_info_store'    =>  'معلومات عن المتجر',
    'add_store' =>  'اضافة متجر',
    'edit_store'    =>  'تعديل على المتجر',

    // error msg
    'no_value'      =>  'غير معروف',
    'no_data_found' => 'للاسف لا يوجد اي بيانات',
    'advice'        =>  'كن متأكد عندما تضيف البيانات يرجى كتابة البيانات بالشكل الصحيح',
    'no_user_info'  => 'لا يوجد اي بيانات خاصة في المشرفين أو العملاء مسجلة لدينا في قاعدة البيانات لاضافة مستخدم',
    'no_category_info'  => 'لا يوجد اي بيانات خاصة  مسجلة لدينا في قاعدة البيانات لاضافة قسم',
    'no_product_info'   =>  'لا يوجد اي بيانات خاصة  مسجلة لدينا في قاعدة البيانات لاضافة منتج',
    'no_cat_found' =>  'لا يوجد أقسام !',
    'no_client_info'   =>   'لا يوجد اي بيانات خاصة  مسجلة لدينا في قاعدة البيانات لاضافة منتج عميل',
    'no_order_info'   =>   'لا يوجد اي بيانات خاصة  مسجلة لدينا في قاعدة البيانات ',
    'no_store_info'   =>   ' لا يوجد اي بيانات خاصة  مسجلة لدينا في قاعدة البيانات لاضافة متجر',
    'no_order'  =>  'لا يوجد اي طلبية للعميل مسجلة لدينا في قاعدة البيانات',


    // helpers
    'click_me'  =>  'اضغط علي',
    'search_place'  =>  'ابحث على المشرف',
    'search_place_category' => 'ابحث على الأقسام',
    'search'    =>  'ابحث & اختار',
    'search_place_product'  =>  'ابحث عن المنتج',
    'poster'    =>  'الملصق',


    // btn
    'create_user'   => 'اضافة مشرف',
    'cancel'        => 'الغاء',
    'delete_title'  =>  'هل أنت متأكد من أنك تريد حدف هدا العنصر؟',
    'delete_text_1'   =>  'سوف يتم حدف جميع الانشطة المتعلقة في البيانات! ',
    'confirm_delete' =>  'أجل , تأكيد الحدف!',
    'cancel_delete' => 'الغاء',
    'delete_success'    =>  'تم الحدف بنجاح!',
    'delete_text'    =>  'تم الحدف العنصر بنجاح',
    'create_category'   => 'اضافة قسم',
    'create_product'    =>  'اضافة منتج',



    // Noty msg
    'success_add'   =>  'تم اضافة البيانات بنجاح',
    'success_edit'  =>  'تم تعديل البيانات بنجاح',
    'success_delete'   =>   'تم حدف البيانات بنجاح',


    // roles
    'create_users'   =>  'اضافة مستخدمين',
    'read_users'     =>  'قرأءة مستخدمين',
    'update_users'  =>  'تعديل على المستخدمين',
    'delete_users'  =>  'حدف مستخدمين',

    'create_categories'   =>  'اضافة أقسام',
    'read_categories'     =>  'قرأءة أقسام',
    'update_categories'  =>  'تعديل على الأاقسام',
    'delete_categories'  =>  'حدف أقسام',

    'create_products'   =>  'اضافة منتجات',
    'read_products'     =>  'قرأءة منتجات',
    'update_products'  =>  'تعديل على المنتجات',
    'delete_products'  =>  'حدف منتجات',


    'create_client'   =>  'اضافة عميل',
    'read_client'     =>  'قرأءة عميل',
    'update_client'  =>  'تعديل على العميل',
    'delete_client'  =>  'حدف عميل',


    'create_orders'   =>  'اضافة طلبيات',
    'read_orders'     =>  'قرأءة طلبيات',
    'update_orders'  =>  'تعديل على طلبيات',
    'delete_orders'  =>  'حدف طلبيات',



    'create_stores'   =>  'اضافة متاجر',
    'read_stores'     =>  'قرأءة متاجر',
    'update_stores'  =>  'تعديل على متاجر',
    'delete_stores'  =>  'حدف متاجر',



    // permission
    'permission'    =>  'صلاحية',
    'permissions'    =>  'الصلاحيات',

    // models
    'categories'    =>  'الأقسام',
    'category'    =>  'القسم',


    // transaltion

    'ar'    =>  [
        'name'  =>  'الاسم بالغة العربية',
        'desc'  =>  'الوصف بالغة العربية',
        'raw'   =>  'الخام بالغة العربية ان وجد',
        'tags'   =>  'التاق ان وجد بالغة العربية',
        'style'   =>  'الستايل ان وجد بالغة العربية',
        'Protection_instructions'   =>  'الحماية والتعليمات بالغة العربية',
    ],

    'en'    =>  [
        'name'  =>  'الاسم بالغة الانجليزية',
        'desc'  =>  'الوصف بالغة الانجليزية',
        'raw'   =>  'الخام بالغة الانجليزية ان وجد',
        'tags'  =>   'التاق ان وجد بالغة الانجليزية',
        'style'   =>  'الستايل ان وجد بالغة الانجليزية',
        'Protection_instructions'   =>  'الحماية والتعليمات بالغة الانجليزية',
    ],
];
